{
   "creature": [
      {
      "id": 2,
      "name": "Air_Elemental",
      "image": "images/Creatures/Air_Elemental.png",
      "type": "Blob Creature",
      "description": "Air elementals are formed by wind and living air currents. They are mostly created by extremely powerful wizards but can occasionally be found out in terrains with high winds. Of course, being made of air only makes them impervious to most physical attacks. They can be dispersed by strong enough winds or contained in certain magical containers.",
      "description_2": "Air elementals are much like their other elemental counterparts. They are not necessarily malicious creatures, but due to their innate danger they should be treated with caution by any adventurers who happen to come across their path.",
      "related": "Null"
      },
      {
      "id": 3,
      "name": "Direwolf",
      "image": "images/Creatures/Direwolf.png",
      "type": "Beast Creature",
      "description": "Direwolves commonly hunt in packs. The Direwolf leads the pack as a alpha while the rest of the pack consists of normal wolves. Notably, unlike normal wolves, dire wolves can be found isolated from their packs. In addition. dire wolves are significantly more aggressive than normal wolves. Once a dire wolf sees you, it's highly likely that it will attack.",
      "description_2": "They are especially know for the enhanced strength and durability compared to their normal wolf counter parts. Dire wolves are also incredibly tacticians who will utilize their numbers to overwhelm prey. There have been certain records which indicate that families of hill giants have domesticated dire wolves as guard dogs. It should also be noted that attempting this as a normal humanoid is incredibly dangerous and will most like end in an untimely demise. /n Do NOT attempt to pet.",
      "related": "Null"
      },
      {
      "id": 4,
      "name": "Dragon",
      "image": "images/Creatures/Dragon.png",
      "type": "Drake Creature",
      "description": "It is highly unlike that you will encounter a dragon. Dragons, despite their evident fame, are incredibly exotic creatures. While there are multiple notable accounts of humanoids befriending dragons or at the very least able to come to an agreement that didn't end in the death of the humanoid. These accounts however, are outweighed significantly by the amount of bodies found either directly trampled by dragons or in towns completely destroyed by a dragon. Dragons are incredibly intelligent creatures, are known to use deception and manipulation to get what they want.",
      "description_2": "Dragons typically grow to around 120ft long with a wingspan of 135ft. Their scales are generally incredibly tough, and, depending on the type of the dragon, can be resistant a variety of elements. Dragons are very well known for their breath attacks, able to devastate entire villages with just one breath. They are also able to utlize their claws and teeth, though normally they can get by with just stepping on whichever adventurer was unfortuante enough to cross their path.",
      "related": "Null"
      },
      {
      "id": 6,
      "name": "Elf",
      "image": "images/Creatures/Elf.png",
      "type": "Humanoid Creature",
      "description": "Elves are a magical race which often lives in forests. They are known for their haughtiness and mostly hermit-like behavior. Most elves live our their hundreds of years of life in isolation from human society. Most elves are highly proficient in archery and magic, making them highly formidable warriors. When encountering an elf, it is exceedingly important to not slight their culture, as elves hold a high amount of pride in their tradition and race.",
      "description_2": "Elves have a typically slender build with pointed ears and sharp facial features. Their lifespan is significantly longer than that of humans, often living for several centuries. Elven society is often structured around close-knit communities that value art, music, and nature. They are known to have a deep connection with the natural world, often acting as protectors of forests and wildlife.",
      "related": "Null"
      },
      {
      "id": 7,
      "name": "Fairy",
      "image": "images/Creatures/Fairy.png",
      "type": "Humanoid Creature",
      "description": "Fairies are small magical beings with wings. They are known for their mischievous nature and their ability to use magic. Fairies are often found in forests and meadows, where they live in small communities. They are known to be very protective of their homes and will often play tricks on humans who venture too close.",
      "description_2": "Fairies have delicate, translucent wings and a petite stature. They are often depicted with a glowing aura and are capable of flight. Their lifespan varies widely depending on the type of fairy, with some living only a few years and others living for centuries. Fairies are deeply connected to nature and are often considered guardians of the natural world.",
      "related": "Null"
      },
      {
      "id": 8,
      "name": "Fire Elemental",
      "image": "images/Creatures/Fire_Elemental.png",
      "type": "Blob Creature",
      "description": "These creatures are a pure manifestation of the element of Fire. They are mostly created by extremely powerful wizards but can occasionally be found out in the wild in places with extremely hot temperatures. The fire this is their body can be split without this creature dying. To go along with this, this creature can combine with any source of fire in comes across, growing in size and in power.",
      "description_2": "Despite rarely ever coming in contact with them, they have an intense rivaly with Water Elementals. If they are ever in the same area as one, they will play tricks and the Water Elementals and make them look bad in any way then can. However, they must be careful when doing so as one splash from their rivals will cause a Fire Elemental to estinguish at once.",
      "related": "Water Elemental",
      "related_id": "33"
      },
      {
      "id": 9,
      "name": "Fire Giant",
      "image": "images/Creatures/Fire_Giant.png",
      "type": "Humanoid Creature",
      "description": "Fire giants are large raging monstrosities that are terrifying both in size and temperament. They are known for their incredible strength and their ability to manipulate fire. In addition, fire giants are also high durable physically, able to easily survive the attacks of multiple adventurers at once. Fire giants are also known for their blacksmithing skills.",
      "description_2": "Fire giants typically stand around 18 feet tall and have a muscular build. Their skin often has a reddish or orange hue, resembling molten rock. They are known to inhabit volcanic regions and are often found in the company of fire elementals. Fire giants have a strong sense of honor and are known to engage in combat with those they deem worthy opponents.",
      "related": "Ice Giant",
      "related_id": "19"
      },
      {
      "id": 10,
      "name": "Gargoyle",
      "image": "images/Creatures/Gargoyle.png",
      "type": "Construct Creature",
      "description": "Gargoyles are stone creatures that are often used as guardians for important buildings. They are known for their ability to come to life and attack intruders who threaten the building they are guarding. Gargoyles are typically made of stone and have a humanoid appearance with wings and sharp claws.",
      "description_2": "Due to their stone composition, gargoyles are highly resistant to physical attacks. They are often animated through magical means and can be quite intelligent, capable of understanding commands and strategizing in combat. Gargoyles are usually found perched on rooftops or ledges, blending in with their surroundings until they spring to life.",
      "related": "Null"
      },
      {
      "id": 11,
      "name": "Ghost",
      "image": "images/Creatures/Ghost.png",
      "type": "Blob Creature",
      "description": "Ghosts are ethereal beings that are often the spirits of the dead. They are known for their ability to pass through solid objects and their haunting presence. Ghosts can vary in appearance, often resembling the person they were in life, but sometimes appearing as shadowy or translucent figures.",
      "description_2": "Ghosts are typically bound to a specific location or object, often due to unfinished business or strong emotions. They can be both benevolent and malevolent, depending on their nature and circumstances. Ghosts are usually invisible to the living, but can sometimes be seen or sensed, especially by those with magical abilities.",
      "related": "Null"
      },
      {
      "id": 14,
      "name": "Goblin",
      "image": "images/Creatures/Goblin.png",
      "type": "Humanoid Creature",
      "description": "Goblins are funny little guys. They love money and stealing things from other people.",
      "description_2": "Goblins should not be trusted by any degree by anyone.",
      "related": "Hobgoblins",
      "related_id": "18"
      },
      { 
      "id": 18,
      "name": "Hobgoblin",
      "image": "images/Creatures/Hobgoblin.png",
      "type": "Humanoid Creature",
      "description": "Hobgoblins are larger and more intelligent than their goblin cousins. Hobgoblins typically grow up to normal human heights with reddish skin. They are known for their military tactics and organization. It is notable that many hobgoblins hold a code of honor and discipline, leading to them being natural leaders within large groups of goblionoids.",
      "description_2": "Communications with hobgoblins is certainly possible, but many researchers find that it typically does not last long before devolving into much more aggressive and non-verbal means. It is, however, incredibly notable that certain hobgoblins have been able to integrate themselves within human societies. According to certain accounts, these hobgoblins still occasionally struggle with their goblinoid nature, as most are hot tempered at best and outright violent at worst.",
      "related": "Goblins",
      "related_id": "14"
      },
      {
      "id": 19,
      "name": "Ice Giant",
      "image": "images/Creatures/Ice_Giant.png",
      "type": "Humanoid Creature",
      "description": "Ice giants are large raging monstrosities that are terrifying both in size and temperament. They are known for their incredible strength and their ability to manipulate ice. In addition, ice giants are also highly durable physically, able to easily survive the attacks of multiple adventurers at once. Ice giants are also known for their blacksmithing skills.",
      "description_2": "Ice giants typically stand around 18 feet tall and have a muscular build. Their skin often has a bluish or white hue, resembling frozen rock. They are known to inhabit icy regions and are often found in the company of water elementals. Ice giants have a strong sense of honor and are known to engage in combat with those they deem worthy opponents.",
      "related": "Fire Giant",
      "related_id": "8"
      },
      {
         "id": 20,
         "name": "Kraken",
         "image": "images/Creatures/Kracken.png",
         "type": "Beast Creature",
         "description": "The king of the ocean, the destroyer of ships, the Kraken. This sea monster resembles a common squid except for being a bit spiky and being at least ten times as big as an average squid. While it may appear to only have one eye, it does have another on the other side of it.",
         "description_2": "It lives in the deepest, dark part of the ocean. It only comes up from its home whenever it senses a ships floating above the ocean. It will procede to then rip the ship to streads and consume any poor soul that happens to be on it. No one truly knows why it loves to attack ships, but perhaps it simply sees them as the only thing big enough to impose upon it and thus must challenge it to retain its crown over the sea. Or, maybe it is just a big kid playing with toys way too agressively.",
         "related": "Null"
      },
      {
      "id": 22,
      "name": "Mermaid",
      "image": "images/Creatures/Mermaid.png",
      "type": "Beast Humanoid Creature",
      "description": "Mermaids are aquatic creatures with the upper body of a human and the lower body of a fish. They are generally peaceful creatures that don't pose a threat to humans unless provoked. Mermaids are known for their enchanting singing voices and their tears. Many records indicate that mermaid tears have certain healing properties. As a result, there are certain parts of the world where mermaids are hunted in order to mass produce their tears via unsavory means.",
      "description_2": "Mermaid tribes have a complex culture that revolves around the sea. While mermaids are generally peaceful, it is not rare that one of their kind will strike out against others who pose as a threat either to their habitat or their kind. Mermaids are powerful magic users, and should be given their due respect.",
      "related": "Null"
      },
      {
      "id": 24,
      "name": "Phoenix",
      "image": "images/Creatures/Phoenix.png",
      "type": "Beast Creature",
      "description": "The majestic bird of fire. Despite being on a constant state of being on fire, the phoenix does not feel any pain from it. However, if it were to perish, its body would burn and the ashes would form together to form a egg. After a while, the egg would hatch and the phoenix would be reborn.",
      "description_2": "Pheonixes tend to be solitary creatures, rarely seeing another of their kind. It is said that the fire of a phoenix burns on forever and can not be estinguished by any means. However, any burns left by this creature are said to heal up faster than an average burn.",
      "related": "Null"
      },
      {
      "id": 29,
      "name": "Slime",
      "image": "images/Creatures/Slime.png",
      "type": "Blob Creature",
      "description": "They may look like delicious jelly, but don't eat them. Otherwise you may lose your entire mouth due to their acidic touch.",
      "description_2": "These creatures are unable to be reasoned with as they lack a consciousness. They only live for consuming what they find around. This does make them good waste disposals however.",
      "related": "Null"
      },
      {
      "id": 31,
      "name": "Unicorn",
      "image":"images/Creatures/Unicorn.png",
      "type": "Beast Creature",
      "description": "These majestic creatures are closely related to horses, one one vital exception between the two of them. That exception is of course the horn that sits on their head. They are also commonly associated with rainbows due to the color of the hair on their mane and tail. Though it is not entirely uncommon to see one with pure white hair. These creature love to stand in spots of the forest where the sun peers through at just the right angle to increase their beauty. Along with the natural light, this creature's eyes are said to always be sparkling, but accounts of it are extremely rare.",
      "description_2": "The horn that makes this creature unique is not just for looks. It also gifts the otherwise ordianary horse with magic. Touching the the horn of a unicorn or drinking from water that has touched the horn is said the cleanse the person of any illness. Beyond that, the horn just looks cool and by some accounts is said to make rainbows.",
      "related": "Null"
      },
      {
      "id": 37,
      "name": "Zombie",
      "image": "images/Creatures/Zombie.png",
      "type": "Humanoid Creature",
      "description": "Zombies are reanimated corpses with varying levels of mobility and sentience. Certain schools of necromancy are able to resurrect corpses with their previous minds completely intact, while other methods of reanimation result in mindless, slow-moving creatures that is commanded by the one who raised them from the dead. As such, zombies can pose varying levels of threat.",
      "description_2": "In combat against zombies, they are typically weak to fire and light(the holy variant is especially effective). In terms of physical durability, most zombies can take quite a beating before being rendered \"dead\" again. They will attack without concern for their own safety, making them dangerous in large numbers.",
      "related": "Null"
      }
   ]
}