{
   "creature": [
      {
      "id": 1,
      "name": "Bugbear",
      "image": "images/Creatures/Bugbear.png",
      "type": "Humanoid Creature",
      "description": "Bugbears are large and hairy goblinoids known for their strength. Bugbears are very notably hairy compared to their other goblinoid brothers. They are typically the biggest members within any goblinoid gathering, and serve as guards. it should be noted that while bugbears do have natural claws, they are particularly sharp, leading to them mostly using weapons acquired from their victims. Of course, due to how only few adventurers are reckless enough to go so deep into a goblinoid lair that they would encounter a bugbear, the weapons that each bugbear wield are typically very well-worn and battered.",
      "description_2": "It is certainly interesting that when researching bugbears, most records describe either the brutal manner in which they manage to defeat their foes or ways to combat groups of bugbears(the latter typically prefaces itself with paragraphs of preamble discussing why this is a terrible idea). There are very few accounts of the culture of bugbears, with what few records there are noting their apparent brutality and idiocy.",
      "related": "Hobgoblins, Goblins",
      "related_id": "5, 4"
      },
      {
      "id": 2,
      "name": "Direwolf",
      "image": "images/Creatures/Direwolf.png",
      "type": "Beast Creature",
      "description": "Direwolves commonly hunt in packs. The Direwolf leads the pack as a alpha while the rest of the pack consists of normal wolves.",
      "description_2": "They are especially know for the enhanced strength and durability compared to their normal wolf counter parts.",
      "related": "Null"
      },
      {
      "id": 4,
      "name": "Goblin",
      "image": "images/Creatures/Goblin.png",
      "type": "Humanoid Creature",
      "description": "Goblins are funny little guys. They love money and stealing things from other people.  hello world",
      "description_2": "Goblins should not be trusted by any degree by anyone.",
      "related": "Hobgoblins, Bugbears",
      "related_id": "5, 1"
      },
      {
      "id": 5,
      "name": "Hobgoblin",
      "image": "images/Creatures/Hobgoblin.png",
      "type": "Humanoid Creature",
      "description": "Hobgoblins are larger than their goblin cousins and more intelligent than their bugbear cousins. They are known for their military tactics and organization. It is notable that many hobgoblins hold a code of honor and discipline, leading to them being natural leaders within large groups of goblionoids.",
      "description_2": "Communications with hobgoblins is certainly possible, but many researchers find that it typically does not last long before devolving into much more aggressive and non-verbal means. It is, however, incredibly notable that certain hobgoblins have been able to integrate themselves within human societies. According to certain accounts, these hobgoblins still occasionally struggle with their goblinoid nature, as most are hot tempered at best and outright violent at worst.",
      "related": "Goblins, Bugbears",
      "related_id": "4, 1"
      },
      {
      "id": 9,
      "name": "Owlbear",
      "image": "images/Creatures/Owlbear.png",
      "type": "Beast Creature",
      "description": "Owlbears are quite aptly named. They are large creatures that have the body of a bear with the head of an owl. Owlbears' fur can range anywhere from yellowish brown to a brownish black. They frequently utilized their sharp beak and claws to attack prey. Owlbears are, without a doubt, the apex predator of their habitats. The average adult male owlbear stands at 8 feet tall, weighing around 1300-1500 pouds. They are without a doubt aggressive and foul-tempered, but that does not mean their intelligence is to be underestimated. Owlbears have been known to set up ambushes for prey, as well as create simple traps. It is also notable that owlbears have an incredible sense of smell, being able to track prey from miles away. ",
      "description_2": "One account was found in the woods by a hunter next to a destroyed carriage and two dead horses. The journal detailed how the previous owner, an apparent caravan merchant was traveling through the woods when they accidentally awoke an owlbear lying in its nest. The journal went to detail how for the next several days while traveling, they would always hear a terrible screeching noise at night. In the mornings, they would wake to find one less member. The merchant described roughly this same routine which went on for another four days. The last entry within the journal was simply a passage from the hymns to Helm repeating multiple times.",
      "related": "Null"
      },
      {
      "id": 10,
      "name": "Slime Cube",
      "image": "images/Creatures/Slime.png",
      "type": "Blob Creature",
      "description": "They may look like delicious jelly, but don't eat them. Otherwise you may lose your entire mouth due to their acidic touch.",
      "description_2": "These creatures are unable to be reasoned with as they lack a consciousness. They only live for consuming what they find around. This does make them good waste disposals however.",
      "related": "Null"
      }
   ]
}